"""
------------------------------------------------GENERAL SETTINGS--------------------------------------------------------
    GLOBAL_NETWORK | Блокчейн для основного взаимодействия ⚠️

    Starknet = 9   zkSync Era = 11
    
    WALLETS_TO_WORK = 0 | Софт будет брать кошельки из таблице по правилам, описаным снизу
    0       = все кошельки подряд
    3       = только кошелек №3 
    4, 20   = кошелек №4 и №20
    [5, 25] = кошельки с №5 по №25
    
    ACCOUNTS_IN_STREAM      | Количество кошельков в потоке на выполнение. Если всего 100 кошельков, а указать 10,
                                то софт сделает 10 подходов по 10 кошельков
                                
    EXCEL_PASSWORD          | Включает запрос пароля при входе в софт. Сначала установите пароль в таблице
    EXCEL_PAGE_NAME         | Название листа в таблице. Пример: 'Starknet' 
"""
GLOBAL_NETWORK = 11             # 9 - для Starknet клеймера, 11 - для EVM клеймера
ACCOUNTS_IN_STREAM = 1         # Количество кошельков в потоке
WALLETS_TO_WORK = 0             # 0 / 3 / 3, 20 / [3, 20]

'------------------------------------------------RETRY CONTROL---------------------------------------------------------'
MAXIMUM_RETRY = 1000              # Количество повторений при ошибках
SLEEP_TIME_RETRY = (5, 10)      # (минимум, максимум) секунд | Время сна после очередного повторения

'------------------------------------------------SLEEP CONTROL---------------------------------------------------------'
SLEEP_MODE = False
SLEEP_TIME = (5, 10)             # (минимум, максимум) секунд
SLEEP_TIME_STREAM = (5, 10)      # (минимум, максимум) секунд

'------------------------------------------------PROXY CONTROL---------------------------------------------------------'
USE_PROXY = False               # True или False | Включает использование прокси

'------------------------------------------------SECURE DATA-----------------------------------------------------------'
# OKX API KEYS https://www.okx.com/ru/account/my-api
OKX_API_KEY = ""
OKX_API_SECRET = ""
OKX_API_PASSPHRAS = ""

# BINANCE API KEYS https://www.binance.com/ru/my/settings/api-management
BINANCE_API_KEY = ""
BINANCE_API_SECRET = ""

# https://2captcha.com/enterpage
TWO_CAPTCHA_API_KEY = ""

# EXCEL AND GOOGLE INFO
EXCEL_PASSWORD = False
EXCEL_PAGE_NAME = "Starknet"


"""
--------------------------------------------------OTHER SETTINGS--------------------------------------------------------
    CLAIM_RECIPIENT_ADDRESS | Определяет на какой кошелек будет собран дроп, при клейме с EVM кошелька

"""
CLAIM_RECIPIENT_ADDRESS = 0x123

"""
--------------------------------------------CLASSIC-ROUTES CONTROL------------------------------------------------------
    
----------------------------------------------------CUSTOM--------------------------------------------------------------        
    
     claim_evm                    # клейм $STRK с помощью EVM кошелька. на 20.02.2024 - не работает
     claim_starknet               # клейм $STRK с помощью Starknet кошелька
     transfer_strk                # трансфер $STRK на кошелек, который находиться в CEX wallet  
     collect_from_sub_okx         # сбор #STRK с субАккаунтов на OKX
     collect_from_sub_binance     # сбор #STRK с субАккаунтов на OKX
    
------------------------------------------------------------------------------------------------------------------------        

    
     Выберите необходимые модули для взаимодействия
     Вы можете создать любой маршрут, софт отработает строго по нему. Для каждого списка будет выбран один модуль в
     маршрут, если софт выберет None, то он пропустит данный список модулей. 
     Список модулей сверху.
     
     CLASSIC_ROUTES_MODULES_USING = [
         ['claim_evm'],
         ...
     ]
"""

CLASSIC_ROUTES_MODULES_USING = [
     ['claim_starknet'],
]
